fellpower/Modulus-Firmware/firmware/s3-bridge/sdkconfig.defaults
# ESP32-S3 ESP-NOW → UART bridge for grblHAL
CONFIG_IDF_TARGET="esp32s3"

# Field build — perf + minimal log noise (boot MAC via printf in espnow_link)
CONFIG_COMPILER_OPTIMIZATION_PERF=y
CONFIG_COMPILER_OPTIMIZATION_ASSERTIONS_DISABLE=y
CONFIG_LOG_DEFAULT_LEVEL_WARN=y

# CPU / flash
CONFIG_ESP_DEFAULT_CPU_FREQ_MHZ_240=y
CONFIG_ESPTOOLPY_FLASHSIZE_8MB=y
CONFIG_ESPTOOLPY_FLASHFREQ_80M=y
CONFIG_ESPTOOLPY_OCT_FLASH=n
CONFIG_PARTITION_TABLE_CUSTOM=y
CONFIG_PARTITION_TABLE_CUSTOM_FILENAME="partitions_ota.csv"
CONFIG_BOOTLOADER_APP_ROLLBACK_ENABLE=y

# Disable brownout detector — WiFi/ESP-NOW init briefly spikes current
CONFIG_ESP32S3_BROWNOUT_DET=n

# WiFi — only needed for ESP-NOW (no TCP stack required)
CONFIG_ESP_WIFI_STATIC_RX_BUFFER_NUM=6
CONFIG_ESP_WIFI_DYNAMIC_RX_BUFFER_NUM=16
CONFIG_ESP_WIFI_TX_BUFFER_TYPE=1
CONFIG_ESP_WIFI_DYNAMIC_TX_BUFFER_NUM=16
CONFIG_ESP_WIFI_ESPNOW_MAX_ENCRYPT_NUM=0
CONFIG_ESP_WIFI_SOFTAP_SUPPORT=n
# Keep radio always-on; power save adds up to 100 ms latency to ESP-NOW
CONFIG_ESP_WIFI_STA_DISCONNECTED_PM_ENABLE=n

# Disable IPv6 to save RAM
CONFIG_LWIP_IPV6=n

# FreeRTOS tick rate
CONFIG_FREERTOS_HZ=1000

# NVS for persistent settings
CONFIG_NVS_ENCRYPTION=n

# Shell on native USB (XIAO USB-C / S3 USB Serial/JTAG) so UART1 can use GPIO43/44
CONFIG_ESP_CONSOLE_USB_SERIAL_JTAG=y
CONFIG_ESP_CONSOLE_USB_SERIAL_JTAG_ENABLED=y

# Default board when NVS has no `board` key. Runtime: USB shell `board mini1|xiao`
CONFIG_S3_BRIDGE_BOARD_MINI1=y
